Same happens with "cloudflare_dns_record"
After creation all subsequent terrafrom plans shows diff:

Terraform v1.11.2
on darwin_arm64
+ provider registry.terraform.io/cloudflare/cloudflare v5.2.0

```
terraform apply:
+ resource "cloudflare_dns_record" "test-provider" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = "192.168.1.1"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "test-provier"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = "XXXX"
    }
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

terraform plan:
```
~ resource "cloudflare_dns_record" "test-provider" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-03-21T16:19:08Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "071a7509b162b93d6d6de4f291ed0ae1"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-21T16:19:08Z" -> (known after apply)
      ~ name                = "test-provider.xxx.xx" -> "test-provider"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
